module TaskTwo where

-- 2. Решите задачу, используя трансформеры монад. Можно не использовать трансформеры,
-- но тогда балл будет сильно ниже. Постарайтесь разделить чистый код и код с
-- сайд-эффектами. Разрешается использовать do-синтаксис. Реализация также должна быть
-- как можно более короткой и эффективной.
--
-- Задача: Реализуйте следующую функцию: она считывает все слова из файла, начинающиеся
-- с префикса, заданного командной строкой. Затем после каждой команды пользователя
-- программа выводит следующее найденное слово в порядке очередности.

solution :: String
solution = "Sorry, can't do that right now:("
